use v5.12;
use utf8;
#HTTP::Message content must be bytes at /usr/lib/perl5/vendor_perl/5.14.2/HTTP/Request/Common.pm line 94
#------------------------------------------------------------------------------------------------------------
# MESSSAGE SETTINGS
#------------------------------------------------------------------------------------------------------------
our $msg = {
    #--------------------------------------------------------------------------------------------------------
    #--- Подстановка
    #-- %unixtime%   — будет заменено текущим timestamp
    #-- %date%       — ... на строку с датой
    #-- %XrandY%     — ... на случайное целое числов в диапазоне от X до Y
    #-- %captcha%    — ... на текст капчи
    #-- @~command~@  — ... на результат выполенения внешней команды 'command'
    #--- Подстановка с параметрами
    #-- #delirium#   — сгенерированный бред
    #-- #string#     — чтение файла построчно
    #-- #boundary#   — чтение файла блоками
    #-------------------------------------------------------------------------------------------------------
    # text => "[code]#boundary#[/code]]",
    # text => "bump\n%date%",
    # text => '@~fortune psalms bible~@',
    # text => '%unixtime%',
    text => '✡#delirium#✡',
    #-------------------------------------------------------------------------------------------------------
    #-- #delirium# config
    delirium => {
        # q - предложение; w - слово; c - символ;
        # small_v - строчные гласные
        # small_c - строчные согласные
        #min_len_w => 0,
        #max_len_w => 0,
        #min_w     => 0,
        #max_w     => 0,
        #min_q     => 20,
        #max_q     => 70,
        #sep_ch    => 0,  #-- частота, с которой добавляются разделители в %
        #small_v    => [qw(a a a y y e e e o o i u u i i o)],
        #small_c    => [qw(q w r t p s d f g h j k l z x c v b n m m h g l l k r q j)],
        #big        => [qw(Y K E N G S H H F V A P R O L D Z C C Y M I T B J)],
        #end        => [".\n"],
        #sep       => [],  #-- разделители слов
    },
    #-------------------------------------------------------------------------------------------------------
    #-- #boundary# config
    boundary => {
        boundary => "----",                  #-- разделитель блоков текста. "----" по умолчанию
        order    => 'random',                #-- порядок считывания блоков (normal - по порядку; random - случайно)
        path     => "$ENV{HOME}/rm/desu/ascii",   #-- путь к файлу
    },
    #-------------------------------------------------------------------------------------------------------
    #-- #string# config
    string => {
        order    => 'random',                #-- см. выше
        num_str  => 15,                       #-- количество счтиывемых строк за раз
        path     => "$ENV{HOME}/cuw",   #-- путь к файлу
    },
};

#------------------------------------------------------------------------------------------------------------
# IMAGE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $img_altering = {
    #-------------------------------------------------------------------------------------------------------
    #-- randnum mode
    #-- Дописывать в файл случайные числа
    # mode        => 'randnum',
    # number_nums => 50,                   #-- количество дописываемых чисел
    #-------------------------------------------------------------------------------------------------------
    #-- randbytes mode
    #-- Дописывать в файл случайные байты
    mode         => 'randbytes',
    number_bytes => 50,                   #-- количество дописываемых байтов
    #-------------------------------------------------------------------------------------------------------
    #-- resize mode
    #-- Изменять разрешение картинки
    #-- необходима программа convert
    #-- работает весьма медленно
    #mode        => 'resize',
    #convert     => 'convert',  #-- путь до программы
    ##args        => '-negate',                 #-- дополнительные аргуметны
    #min         => 100,                  #-- минмальный размер от исходного в %
    #max         => 340,                  #-- максимальный размер
    #-------------------------------------------------------------------------------------------------------
    #-- convert mode
    #-- тот же convert, но без изменения разрешения
    #-- необходима программа convert
    #-- работает весьма медленно
    #mode        => 'convert',
    #convert     => 'convert',  #-- путь до программы
    #args        => '-fill green -pointsize 30 -draw "text 50,50 \'Эта борда называетя НУЛЬТИРЕЧ\'"',
};

our $img = {
    #-------------------------------------------------------------------------------------------------------
    #-- no mode
    #-- Без изображения
    mode     => 'no',
    #-------------------------------------------------------------------------------------------------------
    #-- rand mode
    #-- Сгенерировать случайное изображение
    #mode     => 'rand',
    #args     => {},                    #-- см. документацию к модулю Data::Random, метод rand_image
    #-------------------------------------------------------------------------------------------------------
    #-- single mode
    #-- Постить один указанный файл
    #mode     => 'single',
    #path     => "$ENV{HOME}/rm/suigintou/13338486377102.jpg",    #-- путь к файлу
    #path     => "$ENV{HOME}/1.gif",    #-- путь к файлу
    #-- captcha mode
    #-- Постить изображение капчи
    #mode => 'captcha',
    #-------------------------------------------------------------------------------------------------------
    #-- dir mode
    #-- Постить файлы из каталогов
    #mode        => 'dir',
    #order       => 'random',               #-- random - перемешать файлы; normal - брать по порядку
    #path        => ["$ENV{HOME}/pics/painters"],    #-- пути к файлу
    #regexp      => '', #-- фильтровать имена файлов (вместе с расширением) по регэкспам
    #recursively => 1, #-- искать файлы и в подпапках
    #types       => ['jpg', 'jpeg', 'gif', 'png'],    #-- резрешенные к загрузки типы файлов
    #-------------------------------------------------------------------------------------------------------
    #-- common options
    max_size => 700,                   #-- ограничение на размер файла в кб. 0 для отключения
    altering => $img_altering           #-- обход запрета на повтор картинок
};

#------------------------------------------------------------------------------------------------------------
# VIDEO SETTINGS. KUSABA BASED CHANS ONLY
#------------------------------------------------------------------------------------------------------------
our $vid = {
    #-------------------------------------------------------------------------------------------------------
    #-- Видеохостинг
    type     => 'youtube', #-- Поддерживаемые: youtube
    #-------------------------------------------------------------------------------------------------------
    #-- no mode
    #-- Без видео
    mode     => 'no',
    #-------------------------------------------------------------------------------------------------------
    #-- file mode
    #-- Брать ID видео из файла
    #-- ID должны разделяться пробелами или переносами строк
    # mode     => 'file',
    order    => 'random',        #-- см. где-то выше
    path     => "$ENV{HOME}/youtube",
    #-------------------------------------------------------------------------------------------------------
    #-- download mode
    #-- Искать видео на соответствующем видеохостинге
    #mode     => 'download',
    # save     => "$ENV{HOME}/youtube", #-- сохранить найденные id видео в файл; id разделяются пробелом
    order    => 'random',   #-- см. где-то выше
    pages    => 30,       #-- Колличество страниц, с которых будут взяты видео
    search   => ['suigintou'], #-- Поисковые запросы. Пробелы заменять на символ +
};

#------------------------------------------------------------------------------------------------------------
# CAPTCHA SETTINGS
#------------------------------------------------------------------------------------------------------------
#-- Распознавание капчи
our $captcha_decode = {
    #-------------------------------------------------------------------------------------------------------
    #-- antigate mode
    #mode   => 'antigate',
    #key    => 'bdc525daac2c1c1a9b55a8cfaaf79792',
    #opt    => {},  #-- см. документацию к модулю WebService::Antigate
    #-------------------------------------------------------------------------------------------------------
    #-- captchabot mode
    #mode   => 'captchabot',
    #key    => '',
    #opt    => {},  #-- см. документацию к модулю WebService::Antigate
    #-------------------------------------------------------------------------------------------------------
    #-- hand mode
    ##-- Ручной ввод капчи.
    #mode   => 'hand',
    #imgv   => '/usr/bin/feh',     #-- путь до программы просмотра изображений
    #arg    => '-d --geometry 400x300 -Z', #-- аргументы
    #-- gui hand mode
    #-- Ручной ввод капчи через GUI.
    #-- Необходим Gtk2
    mode   => 'none',
    #-- tesseract OCR
    #-- Необходим convert (пакет ImageMagick) и сам tesseract
    mode   => 'tesseract',
    #lang   => 'rus',           #-- eng, rus, etc.
    config => 'englishletters', #-- название конфига для tesseract. см README
    #config => 'ruletters', #-- название конфига для tesseract. см README
};
