use utf8;
#------------------------------------------------------------------------------------------------------------
# FORM SETTINGS
#------------------------------------------------------------------------------------------------------------
my $post_fields =  {
    #-- при указании ссылки на список оттуда будет взято случайное значение
    #-- например: thread     => [1,3,4,5] #-- ответ в случайный тред из заданных
    board      => 'b',
    thread     => 0,
    email      => "",
    name       => "",
    subject    => "",
    password   => "fNfR31",
};

#------------------------------------------------------------------------------------------------------------
# MAIN CONFIG
#------------------------------------------------------------------------------------------------------------
our $mode_config = {
    post_fields        => $post_fields,
    send               => {
        #-- отправлять пост сразу после ввода капчи
        mode           => 'plain',
        plain          => {},
        #-- накапливать капчи
        #mode           => 'accumulate',
        accumulate     => {
            number     => 2,
        },
    },
    #-- перемещать удачно распознанную капчу в заданный каталог, а не удалять
    save_captcha       => '',
    #-- таймаут
    timeout            => {
        get_captcha    => 10,
        prepare_data   => 90,
        handle_captcha => 60,
        make_post      => 90,
    },
    #-- максимальное количество работающих прокси; еще не сделано
    #max_proxies        => 1,
    #-- максимальное количество одновременного работающих потоков
    max_threads        => {
        make_post      => 100,
        get_captcha    => 1,
        prepare_data   => 9,
        handle_captcha => 5,
    },
    #-- пытаться отправить пост повторно, если капча была введена неправильно
    wrong_captcha_retry => 1,
    #-- повторно постить с хороших прокси - зациклить вайп
    loop              => 1,
    #-- колличество попыток запросить капчу,отправить пост, выбрать текст и картинку,распознать капчу
    attempts          => {
        get_captcha   => 3,
        make_post     => 1,
        prepare_data  => 1,
        handle_captcha => 1,
    },
    #-- завершать программу, если нет запущенных или стоящих в очереди прокси; плохо дружит с вотчерами
    autoexit          => 0,
    #-- единицы измерения скорости постинга (second/minute/hour)
    speed             => 'minute',
    watchers          => { },
};
