#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $find = {
    board   => 'b',           #-- доска, на которой искать посты
    regexp  => 'code|autobump',           #-- искать бампы по регулярному выражению
    threads => [10009851],           #-- в каких тредах искать
};
my %del_set = (
    board          => 'b',           #-- доска, с которой удалять сообщения
    password       => "fNfR3",
    find           => $find,
    max_del_thrs   => 1,       #-- максимально количество запущенных потоков
    delete_timeout => 20,      #-- таймаут
);

#------------------------------------------------------------------------------------------------------------
# BUMP SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    #-- Дополнительное условие для бампа
    #-- Бампать, если...
    bump_if   => {
                  #-- Здесь cтраницы нумеруются с 1! Т.е. для нулевой страницы писать 1
                  #-- ...тред находится на N-ой странице
                  # on_page     => 1,
                  #-- ...тред НЕ находится на N-ой странице
                  not_on_page => 1,
                 },
    timeout   => 60,
    interval  => 60,
    msg_data  => $msg,
    img_data  => $img,
    #-- Удалять бампы
    silent    => \%del_set,
    post_cnf  => {
        board      => 'b',
        thread     => 10009851,               #-- Номер треда, который нужно бампать
        email      => "",
        name       => "",
        subject    => "",
        password   => "fNfR3",
    },
);
