#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $find = {
    board   => 'b',           #-- доска, на которой искать посты
    regexp  => '\d{10}}',           #-- искать бампы по регулярному выражению
    threads => [10013209],           #-- в каких тредах искать
};
my %del_set = (
    board          => 'b',           #-- доска, с которой удалять сообщения
    password       => "fNfR3",
    find           => $find,
    max_del_thrs   => 1,       #-- максимально количество запущенных потоков
    delete_timeout => 20,      #-- таймаут
);

#------------------------------------------------------------------------------------------------------------
# BUMP SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    #-- Дополнительное условие для бампа
    #-- Бампать, если...
    bump_if   => {
                  #-- ...тред находится на заданных страницах
                  # on_pages     => [0],
                  #-- ...тред НЕ находится на заданных страницах
                  not_on_pages => [0],
                 },
    timeout   => 30,
    interval  => 60*5,
    msg_data  => $msg,
    img_data  => $img,
    #-- Удалять бампы
    silent    => \%del_set,
    post_cnf  => {
        board      => 'b',
        thread     => 10013209,
        email      => "",
        name       => "",
        subject    => "",
        password   => "fNfR3",
    },
);
