#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $delete_cnf = {
    board       => 'b',           #-- доска, с которой удалять сообщения
    password    => "fNfR3",
    #by_id       => [1,2,3],       #-- вручную задать номера постов/тредов или
    find        => '0\s?<br />',           #-- искать по регулярному выражению
    find        => 'b\d{10}b',           #-- искать по регулярному выражению
    #find        => '.*',           #-- искать по регулярному выражению
    thread      => [9966124],           #-- искать посты в тредах
    #page        => [0..2],        #-- искать треды на страницах
};
my %del_set = (
    delete_cnf        => $delete_cnf,
    max_del_thrs      => 1,       #-- максимально количество запущенных потоков
    delete_timeout    => 20,      #-- таймаут
);

#------------------------------------------------------------------------------------------------------------
# BUMP SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    bump_if   => {
                  time => 60,
                 },
    timeout   => 60,
    interval  => 1,
    msg_data  => $msg,
    img_data  => $img,
    silent    => \%del_set,
    post_cnf  => {
        board      => 'b',
        thread     => 9966124,               #-- Номер тред, который нужно бампать
        email      => "",
        name       => "",
        subject    => "",
        password   => "fNfR3",
    },
);
 
