#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $find = {
    board   => 'b',           #-- доска, на которой искать посты
    regexp  => '\d{10}',           #-- искать бампы по регулярному выражению
    threads => [10013209],           #-- в каких тредах искать
};
my %del_set = (
    board          => 'b',           #-- доска, с которой удалять сообщения
    password       => "fNfR3",
    find           => $find,
    max_del_thrs   => 1,       #-- максимально количество запущенных потоков удаления
    delete_timeout => 20,      #-- таймаут
);

#------------------------------------------------------------------------------------------------------------
# BUMP SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    #-- Дополнительное условие для бампа
    #-- Бампать, если...
    bump_if   => {
                  #-- ...тред находится на заданных страницах
                  # on_pages     => [0],
                  #-- ...тред НЕ находится на заданных страницах
                  not_on_pages => [0],
                 },
    timeout   => 30,
    interval  => 60*5, #-- Проверять, нужен ли бамп, через заданный интервал
    silent    => \%del_set, #-- Удалять бампы. закомментировать для отключения
    post_cnf  => {
                  #-- при указании ссылки на список, оттуда будет взято случайное значение
                  #-- например: thread     => [1,3,4,5] #-- ответ в случайный тред из заданных
                  #-- постинг на борду и в другие треды (например, [0, 435435]) лучше не смешивать.
                  board      => 'b',
                  thread     => 10013209,
                  email      => "",
                  name       => "",
                  subject    => "",
                  password   => "fNfR3",
                 },
);
