#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $delete_cnf = {
    board       => 'b',           #-- доска, с которой удалять сообщения
    password    => "fNfR3",
    #by_id       => [1,2,3],       #-- вручную задать номера постов/тредов или
    #find        => '✡',           #-- искать по регулярному выражению
    #find        => '.*',           #-- искать по регулярному выражению
    #find        => 'Dollchan',           #-- искать по регулярному выражению
    find        => '<blockquote><div class="postmessage">(\s+)?</div></blockquote>',
    #thread      => [9950652],           #-- искать посты в тредах
    page        => [0..5],        #-- искать треды на страницах
};
our %mode_config = (
    delete_cnf        => $delete_cnf,
    max_del_thrs      => 1,       #-- максимально количество запущенных потоков
    delete_timeout    => 60,      #-- таймаут
);

