#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $find = {
    board   => 'b',        #-- доска, на которой искать посты
    threads => {           #-- треды
        include => 1,       #-- удалять найденные треды, 1 - да, 0 - нет
        regexp  => '.*',      #-- фильтровать по регэкспу
        pages   => [1],      #-- на каких страницах искать
    },
    replies => {           #-- ответы
        #threads => [],      #-- в каких тредах искать (по id)
        threads => 'found', #-- искать в уже найденных тредах (см. выше)
        regexp  => 'на',    #-- филтровать по регэкспу
    },
};
our %mode_config = (
    ids            => [1,2,3], #-- вручную задать номера удаляемых постов/тредов
    find           => $find,   #-- или искать
    #password       => "LeWoNy27",
    password       => "123",
    board          => 'b',     #-- доска, с которой удалять сообщения
    max_del_thrs   => 1,       #-- максимально количество запущенных потоков
    delete_timeout => 60,      #-- таймаут
);

