#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $delete_cnf = {
    board       => 'b',           #-- доска, с которой удалять сообщения
    password    => "fNfR3",
    #by_id       => [1,2,3],       #-- вручную задать номера постов/тредов или
    #find        => '✡',           #-- искать по регулярному выражению
    find        => '.*',           #-- искать по регулярному выражению
    #thread      => [45849],           #-- искать посты в тредах
    page        => [0..3],        #-- искать треды на страницах
};
our %mode_config = (
    delete_cnf        => $delete_cnf,
    max_del_thrs      => 5,       #-- максимально количество запущенных потоков
    delete_timeout    => 30,      #-- таймаут
);

