#------------------------------------------------------------------------------------------------------------
# DELETE SETTINGS
#------------------------------------------------------------------------------------------------------------
my $delete_cnf = {
    password    => "fNfR3",
    board       => 'b',           #-- доска, с которой удалять сообщения
    #by_id       => [1,2,3],       #-- вручную задать номера постов/тредов или
    regexp        => '.*',         #-- фильтровать найденные посты по рэгкспу
    # threads      => [10001305],           #-- искать посты в тредах
    pages        => [0..4],        #-- искать треды на страницах
};
our %mode_config = (
    delete_cnf        => $delete_cnf,
    max_del_thrs      => 1,       #-- максимально количество запущенных потоков
    delete_timeout    => 60,      #-- таймаут
);

