use utf8;
#------------------------------------------------------------------------------------------------------------
# PROXY CHECKER SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    #-- Настройки постинга. В общем, похуй на эти настройки.
    post_cnf => {
        board      => 'b',
        thread     => 0,
        thread     => 10380824,
        email      => "",
        name       => "",
        subject    => "",
        password   => "fNfR3",
    },
    max_thrs   => 120, #-- максимальное колличество запущенных потоков
    timeout    => 120,
    save       => 'proxy/my/latest1', #-- сохранять хорошие прокси в файл; если не указано, прокси печаются при выходе
);
