#------------------------------------------------------------------------------------------------------------
# PROXY CHECKER SETTINGS
#------------------------------------------------------------------------------------------------------------
our %mode_config = (
    #-- Настройки постинга. В общем, похуй на эти настройки.
    post_cnf => {
        board      => 'b',
        thread     => 0,
        email      => "",
        name       => "",
        subject    => "",
        password   => "fNfR3",
    },
    max_thrs   => 100, #-- максимальное колличество запущенных потоков
    timeout    => 360,
);
